# Case Study - Air Passengers
<br/>
pandas 를 사용하여 csv 형태의 time series 데이터를 처리하는 방법에 대해 알아본다.

***data*** 
- 1940 ~ 1960까지 매달 비행기 이용객 수를 정리한 데이터
- 시계열 toy data
- 월별, 년도별 승객은 얼마나 될까?
- 이전달과 이번달의 승객 차이는? 상승율은?
- 누적 승객수, 최고&최소 승객수?

In [1]:
import pandas as pd

In [2]:
df_time_series = pd.read_csv("AirPassengers.csv")
df_time_series.head()

     Month  #Passengers
0  1949-01          112
1  1949-02          118
2  1949-03          132
3  1949-04          129
4  1949-05          121

In [3]:
df_time_series["step"] = range(len(df_time_series))
df_time_series.head()

     Month  #Passengers  step
0  1949-01          112     0
1  1949-02          118     1
2  1949-03          132     2
3  1949-04          129     3
4  1949-05          121     4

In [4]:
df_time_series["cum_sum"] = df_time_series["#Passengers"].cumsum()
df_time_series["cum_max"] = df_time_series["#Passengers"].cummax()
df_time_series["cum_min"] = df_time_series["#Passengers"].cummin()
df_time_series.head()

     Month  #Passengers  step  cum_sum  cum_max  cum_min
0  1949-01          112     0      112      112      112
1  1949-02          118     1      230      118      112
2  1949-03          132     2      362      132      112
3  1949-04          129     3      491      132      112
4  1949-05          121     4      612      132      112

In [5]:
import numpy as np
# Month를 "-"를 기준으로 split
temp_date = df_time_series["Month"].map(lambda x : x.split("-"))

In [6]:
temp_date = np.array(temp_date.values.tolist())
temp_date[:5]

array([['1949', '01'],
       ['1949', '02'],
       ['1949', '03'],
       ['1949', '04'],
       ['1949', '05']], dtype='<U4')

In [7]:
df_time_series["year"] = temp_date[:, 0]
df_time_series["month"] = temp_date[:, 1]

In [8]:
df_time_series.head()

     Month  #Passengers  step  cum_sum  cum_max  cum_min  year month
0  1949-01          112     0      112      112      112  1949    01
1  1949-02          118     1      230      118      112  1949    02
2  1949-03          132     2      362      132      112  1949    03
3  1949-04          129     3      491      132      112  1949    04
4  1949-05          121     4      612      132      112  1949    05

In [9]:
#diff : 이전값과 현재값의 차이 구하기
df_time_series["diff"] = df_time_series["#Passengers"].diff().fillna(0)
df_time_series[:5]

     Month  #Passengers  step  cum_sum  cum_max  cum_min  year month  diff
0  1949-01          112     0      112      112      112  1949    01   0.0
1  1949-02          118     1      230      118      112  1949    02   6.0
2  1949-03          132     2      362      132      112  1949    03  14.0
3  1949-04          129     3      491      132      112  1949    04  -3.0
4  1949-05          121     4      612      132      112  1949    05  -8.0

In [10]:
#pct_change : 몇퍼센트 증가했는지 감소했는지 확인
df_time_series["#Passengers"].pct_change().map(lambda x : x*100).map(lambda x : " %.2f" % x)

0          nan
1         5.36
2        11.86
3        -2.27
4        -6.20
        ...
139      -2.57
140     -16.17
141      -9.25
142     -15.40
143      10.77
Name: #Passengers, Length: 144, dtype: object

In [11]:
df_time_series["pct"]= df_time_series["#Passengers"].pct_change().map(lambda x: "%.2f" % (x * 100))